Revit 2027 API
BuiltInFailures.OverlapFailures.RoomSeparationLinesOverlap Property
 Highlighted room separation lines overlap. One of them may be ignored when Revit finds room boundaries. Delete one of the lines.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RoomSeparationLinesOverlap { get; }
Public Shared ReadOnly Property RoomSeparationLinesOverlap As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RoomSeparationLinesOverlap {
	FailureDefinitionId^ get ();
}
static member RoomSeparationLinesOverlap : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.OverlapFailures Class
Autodesk.Revit.DB Namespace